Mosher23/IR-Thread-Meter/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_CHIP_PROJECT_CONFIG="main/MatterProjConfig.h"
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8000
CONFIG_DEVICE_SOFTWARE_VERSION_NUMBER=10
CONFIG_DEFAULT_DEVICE_HARDWARE_VERSION=1
CONFIG_USE_TEST_SERIAL_NUMBER="00000001"

# XIAO ESP32-C6 RF switch. Build variants override this choice as needed.
CONFIG_SMARTMETER_INTERNAL_ANTENNA=y

# USB Serial/JTAG console leaves UART1 for the IR head.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# BLE is used only for Matter commissioning.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# Native OpenThread on the ESP32-C6 IEEE 802.15.4 radio.
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Matter Electrical Meter device type (Matter 1.6 data model).
CONFIG_SUPPORT_ELECTRICAL_POWER_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_ELECTRICAL_ENERGY_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_KEYPAD_INPUT_CLUSTER=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=3
CONFIG_SUPPORT_BRIDGED_DEVICE_BASIC_INFORMATION_CLUSTER=n

CONFIG_MBEDTLS_HKDF_C=y
